<template>
  <Pagetitle text="堆和栈学习" />
  <Pagecontent>
    <h3>数据类型：</h3>
    <Tagtext>
      数据类型分为基本数据类型(String, Number, Boolean, Null,
      Undefined，Symbol)和引用数据类型(Array, String)
    </Tagtext>
    <ul>
      <li>1、基本数据类型的特点：直接存储在栈(stack)中的数据</li>
      <li>
        2、引用数据类型的特点：在栈中存储的是堆内存的指针地址，真实的数据存放在堆内存。
      </li>
    </ul>
    <h3>
      堆与栈实际上是操作系统对进程占用的内存空间的两种管理方式，主要区别有：
    </h3>
    <ul>
      <li>
        1、管理方式不同：栈由操作系统自动分配释放，无需我们手动控制；堆的申请和释放工作由程序员控制，容易产生内存泄漏；
      </li>
      <li>
        2、空间大小不同：每个进程拥有的栈大小要远远小于堆大小。理论上，进程可申请的堆大小为虚拟内存大小，进程栈的大小
        64bits 的 Windows 默认 1MB，64bits 的 Linux 默认 10MB；
      </li>
      <li>
        3、分配方式不同：堆都是动态分配的，没有静态分配的堆。<br />
        栈有2种分配方式：静态分配和动态分配。静态分配是由操作系统完成的，<br />
        比如局部变量的分配。动态分配由alloca()函数分配，但是栈的动态分配和堆是不同的，它的动态分配是由操作系统进行释放，无需我们手工实现。
      </li>
      <li>
        4、分配效率不同。栈由操作系统自动分配，会在硬件层级对栈提供支持：分配专门的寄存器存放栈的地址，压栈出栈都有专门的指令执行，这就决定了栈的效率比较高。堆则是由C/C++提供的库函数或运算符来完成申请与管理，实现机制较为复杂，频繁的内存申请容易产生内存碎片。显然，堆的效率比栈要低得多。
      </li>
      <li>
        5、存放内容不同。栈存放的内容，函数返回地址、相关参数、局部变量和寄存器内容等，堆中主要存储数组和对象。
      </li>
    </ul>
    <h3>栈简介：</h3>
    <Tagtext>
      栈是一种数据结构，它按照先进后出的原则存储数据，先进入的数据被压入栈底，最后的数据在栈顶，需要读数据的时候从栈顶开始弹出数据。
      <br />
      栈是一种只能在栈顶进行插入和删除的特殊线性表。<br />
      栈分顺序栈和链式栈两种：栈是一种线性结构，所以可以使用数组或链表（单向链表、双向链表或循环链表）作为底层数据结构。<br />
      使用数组实现的栈叫做顺序栈，使用链表实现的栈叫做链式栈，二者的区别是顺序栈中的元素地址连续，链式栈中的元素地址不连续。
    </Tagtext>
    <p>
      当在一段代码块定义一个基本数据类型的变量时，js就在栈中为这个变量分配内存空间，当该变量不再被使用时(没有被引用)，js会自动释放掉为该变量所分配的内存空间，该内存空间可以立即被另作他用。
    </p>
    <h4>函数调用：</h4>
    <div>
      参数和返回地址按照某个约定顺序压入栈中。然后跳到目标代码。执行完之后。按照约定把这些信息清理出去，或者由调用方清理，看约定。把返回值放在寄存器或者栈中。恢复原来的位置，继续执行。所以需要保留的现场信息全部在栈里面。
      (这个知识点太大了，只能简述下，有时间了要再仔细的学习下)
    </div>
    <h4>Call Stack (调用栈)：</h4>
    <div>
      调用栈是解释器（比如浏览器中的 JavaScript
      解释器）追踪函数执行流的一种机制。当执行环境中调用了多个函数时，通过这种机制，我们能够追踪到哪个函数正在执行，执行的函数体中又调用了哪个函数。
    </div>
    <ul>
      <li>1、每调用一个函数，解释器就会把该函数添加进调用栈并开始执行。</li>
      <li>
        2、正在调用栈中执行的函数还调用了其它函数，那么新函数也将会被添加进调用栈，一旦这个函数被调用，便会立即执行。
      </li>
      <li>
        3、当前函数执行完毕后，解释器将其清出调用栈，继续执行当前执行环境下的剩余的代码。
      </li>
    </ul>
    <h4>栈溢出：</h4>
    <div>
      出现这种情况最常见的场景就是递归，当没有结束条件时，就会一直调用本身，进行压栈操作，就会超出了栈的最大范围，就会报错，网页卡死。
    </div>
    <h5>栈溢出的影响：</h5>
    <div>
      会出现影响，因为js是单线程语言，只有一个调用栈，这样就会造成js主线程被占用出现堵塞，影响页面的渲染，导致页面空白。
    </div>
  </Pagecontent>
</template>
