<template>
  <PageTitle text="React-Diff算法" />
  <PageContent>
    <h3>react-diff算法是广度优先遍历还是深度优先遍历？</h3>
    <p>diff算法是深度优先遍历</p>
    <h3>react虚拟dom：</h3>
    <p>
      虚拟dom本质上是以js对象对dom描述的存在。<br />
      <br />
      操作方面：当我们使用原生对dom进行操作时，如果操作量级比较小还可以，但是当我们的操作再上升几个量级，就会显得繁琐且容易出错，虚拟dom相当于是操作js对象简单方便。<br />
      <br />
      性能方面：当我们一次操作需要更新10个节点，浏览器没有那么智能，收到第一个更新dom请求后就会执行，不直到后续还有多个请求，所以会执行10次，而通过虚拟dom，同样更新10个节点，虚拟dom不会立即操作dom，而是将这10更新的内容保存到js对象中，最终将这个js对象一次性的渲染到dom上，能够有效避免真实DOM的频繁更新，减少多次引起的重绘与回流，提高性能。<br />
    </p>
    <h3>react中的key值：</h3>
    <p>
      key值在列表中要是唯一值，因为新老虚拟dom对比使用到了react内部的diff算法，key的选择策略原则是不需要全局唯一，但列表中必须唯一，因为当两个虚拟dom进行对比的时候只比较同层的节点，不同的元素类型产生不同的dom节点，再添加唯一的key值，就可以判断当前节点是否进行了改变，可以减少节点的创建和销毁，当节点较多时性能就会得到显著提高。
    </p>
  </PageContent>
</template>
