<template>
  <PageTitle text="前端跨域问题" />
  <PageContent>
    <h4>
      跨域指的是浏览器的同源策略机制，为了保障数据的通信安全。<br />
      同源：域名+协议+端口；<br />
      服务器与服务器之间发送请求是不存在跨域行为的；
    </h4>
    <h3>xss（跨站脚本攻击）：</h3>
    <p>
      使用恶意脚本代码，将一些隐私数据像cookie、session发送给攻击者，将受害者重定向到一个由攻击者控制的网站，在受害者的机器上进行一些恶意操作。还有的脚本是将用户的信息上传到恶意服务器，然后通过这些信息登录平台账号进行恶意操作。
    </p>
    <h3>csrf：cross-site request forgery：跨站点请求伪造</h3>
    <p>
      csrf不需要恶意代码注入，只需引导用户登录第三方页面，获取到用户的cookie、session或者登录信息，然后进行恶意请求操作
    </p>

    <h5>
      有三个标签是允许跨域加载资源：<br />
      1、img标签<br />
      2、link标签<br />
      3、script标签
    </h5>
    <h3>请求跨域，那么请求发生出去了吗？</h3>
    <p>
      请求发送出去了，并且服务端也做出了对应的响应，但是返回的数据被浏览器拦截了。
    </p>
    <h3>跨域解决方案：</h3>
    <p>
      1、cors：浏览器会自动进行cors通信，实现cors的关键是服务端要支持，需要设置下access-control-allow-origin这个字段，表示那些网站可以访问资源，设置通配符就是所有都可以访问。
    </p>
    <p>2、proxy代理：只需要前端配置下代理的域名地址就可以</p>
    <p>
      3、jsonp是跨域领域中历史非常传统的一种方法。上面我们有提到一些标签是不受跨域限制的，这里使用的就是script标签
    </p>
    <h3>proxy的工作原理：</h3>
    <p>
      它的实质使用的http-proxy-middleware这个http中间件，实现请求转发给其它服务器，http-proxy-middleware这个中间件会使用nodejs搭建一个小型服务器，只是为了接口的代理。
    </p>
    <h3>为什么不存在跨域问题？</h3>
    <p>
      这是因为我们本地开发会启动（webpack-dev-server）一个本地开发服务器，所以我们的应用是独立运行在localhost的一个端口上的，而后端服务运行在另一个地址上。<br />
      由于同源策略的原因，本地访问后端服务器就会出现跨域请求问题，通过proxy代理之后，相当于浏览器和服务端之间添加了一个代理者，本地发送请求给代理服务器，代理服务器响应请求并发送请求给后端服务器，获取数据之后再响应给本地。<br />
      代理服务器和浏览器同源不存在跨域行为。
    </p>
  </PageContent>
</template>
