<template>
  <PageTitle text="Spa/Seo/SSR理解" />
  <PageContent>
    <h3>SPA：</h3>
    <p>
      优点：切换页面的时候只需要重写页面发生了变化的部分而不是整个页面重写，页面之间的切换变得更快了，一定程度上减少了对服务器的压力。<br />
      <br />
      缺点：首屏打开速度慢，因为用户首次打开需要加载框架代码和应用程序代码，然后再渲染展示，不利于SEO。
    </p>
    <h3>SEO：</h3>
    <p>
      搜索引擎优化，是一种通过了解搜索引擎的运作规则（如何抓取网站页面，如何索引以及如何根据特定的关键字展现搜索结果排序等）来调整网站，以提高该网站在搜索引擎中某些关键词的搜索结果排名。
    </p>
    <h3>SSR：</h3>
    <p>
      SSR：为了解决SPA和SEO的冲突被创造<br /><br />
      优点：更快的响应时间，因为在服务端进行渲染的，更好的SEO，可以将SEO的关键信息直接在后台就渲染成HTML，而保证搜索引擎的爬虫都能爬取到关键数据。
      <br /><br />
      缺点：占用更多的服务器资源，一些常用的浏览器api不能使用，可能会有某些原因导致服务端渲染出来的和浏览器的不一致。
    </p>
  </PageContent>
</template>
